# AnalyticalModelSelector Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalModelSelector Constructor
AnalyticalModelSelector Class See Also
---
Creates a selector for the analytical model geometry.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalyticalModelSelector()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AnalyticalModelSelector()
```

# Remarks
This version is useful for single-curve or single-point analytical models. Additionally, this only acts with respect to the entire curve or point.
# See Also
AnalyticalModelSelector Class
AnalyticalModelSelector Overload
Autodesk.Revit.DB.Structure Namespace